<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"a7fe36f2f6f5fb588915f9294acee9f404312e542cbb749ebaea642a4fd9e37d","plan_job_ref":"Job CICD for Splitrr Infra #19 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655026366","plan_out_hash":"23d8e5aef150995e875e1b52cd2af26a85cb85caefe078d967cfbf30c516a59b","plan_hash":"0706be66ccd4006f7476fef04d89f2bc220be1ce41ca0a8b00a9553087aaf5f8","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 7 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.alb.aws_alb.splitrr_alb will be created
+   resource "aws_alb" "splitrr_alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "splitrr-dev-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = [
+           "sg-03f989b47ccc8e222",
        ]
+       subnets                                                      = [
+           "subnet-00cd8d95d55e658ac",
+           "subnet-05af162f25139917c",
        ]
+       tags                                                         = {
+           "Name" = "splitrr-dev-alb"
        }
+       tags_all                                                     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb"
+           "Project" = "Splitrr"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb.aws_alb_listener.backend_end will be created
+   resource "aws_alb_listener" "backend_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "splitrr-dev-alb-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_alb_listener.https_listener will be created
+   resource "aws_alb_listener" "https_listener" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d"
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags              = {
+           "Name" = "splitrr-dev-alb-https-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-https-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "Not Found"
+               status_code  = "404"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.app_route53_record.aws_route53_record.site_domain will be updated in-place
!~  resource "aws_route53_record" "site_domain" {
        id                               = "Z021384721RGJE537TR9W_app_A"
        name                             = "app"
#        (8 unchanged attributes hidden)

!~      alias {
!~          name                   = "splitrr-dev-alb-949497529.us-east-1.elb.amazonaws.com" -> (known after apply)
!~          zone_id                = "**************" -> (known after apply)
#            (1 unchanged attribute hidden)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be updated in-place
!~  resource "aws_route53_record" "site_domain" {
        id                               = "Z021384721RGJE537TR9W_api_A"
        name                             = "api"
#        (8 unchanged attributes hidden)

!~      alias {
!~          name                   = "splitrr-dev-alb-949497529.us-east-1.elb.amazonaws.com" -> (known after apply)
!~          zone_id                = "**************" -> (known after apply)
#            (1 unchanged attribute hidden)
        }
    }

  # module.rds.aws_db_instance.primary will be created
+   resource "aws_db_instance" "primary" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_DB_NAME::"
+       db_subnet_group_name                  = "splitrr-dev-rds-db-subnet-group"
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       deletion_protection                   = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "16.1"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "splitrr-dev-rds-primarydb"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t4g.medium"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       manage_master_user_password           = true
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = "************************************"
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = false
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       performance_insights_enabled          = true
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_encrypted                     = true
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags                                  = {
+           "Name" = "splitrr-dev-rds-db-instance"
        }
+       tags_all                              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-rds-db-instance"
+           "Project" = "Splitrr"
        }
+       timezone                              = (known after apply)
+       username                              = "postgres"
+       vpc_security_group_ids                = [
+           "sg-0bc5f9daa28703541",
        ]
    }

  # module.target_group.aws_lb_listener_certificate.alb_listener_certificate will be created
+   resource "aws_lb_listener_certificate" "alb_listener_certificate" {
+       certificate_arn = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d"
+       id              = (known after apply)
+       listener_arn    = (known after apply)
    }

  # module.target_group.aws_lb_listener_rule.host_based_weighted_routing will be created
+   resource "aws_lb_listener_rule" "host_based_weighted_routing" {
+       arn          = (known after apply)
+       id           = (known after apply)
+       listener_arn = (known after apply)
+       priority     = 99
+       tags_all     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }

+       condition {
+           host_header {
+               values = [
+                   "api.dev.bibek65.tech",
                ]
            }
        }
    }

  # module.target_group.aws_lb_target_group.splitrr_alb_target_group will be created
+   resource "aws_lb_target_group" "splitrr_alb_target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "splitrr-dev-lb-lb-tg"
+       name_prefix                        = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Name" = "splitrr-dev-lb-lb-tg"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-lb-lb-tg"
+           "Project" = "Splitrr"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"

+       health_check {
+           enabled             = true
+           healthy_threshold   = 5
+           interval            = 30
+           matcher             = "200"
+           path                = "/api/v1/health-check"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 5
+           unhealthy_threshold = 2
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_group_health (known after apply)

+       target_health_state (known after apply)
    }

Plan: 7 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #19](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655026366)